zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/include/stm32mp2xx_hal_gpio_ex.h
/**
  * @brief   AF 6 selection
  */
#define GPIO_AF6_FDCAN3        ((uint8_t)0x06)  /* FDCAN3 Alternate Function mapping  */
#define GPIO_AF6_I2C4          ((uint8_t)0x06)  /* I2C4 Alternate Function mapping  */
#define GPIO_AF6_I2C5          ((uint8_t)0x06)  /* I2C5 Alternate Function mapping  */
#define GPIO_AF6_LPUART1       ((uint8_t)0x06)  /* LPUART1 Alternate Function mapping  */
#define GPIO_AF6_TIM14         ((uint8_t)0x06)  /* TIM14 Alternate Function mapping  */
#define GPIO_AF6_TIM17         ((uint8_t)0x06)  /* TIM17 Alternate Function mapping  */
#define GPIO_AF6_UART7         ((uint8_t)0x06)  /* UART7 Alternate Function mapping */
#define GPIO_AF6_UART8         ((uint8_t)0x06)  /* UART8 Alternate Function mapping */
#define GPIO_AF6_UART9         ((uint8_t)0x06)  /* UART9 Alternate Function mapping */
#define GPIO_AF6_USART1        ((uint8_t)0x06)  /* USART1 Alternate Function mapping */
#define GPIO_AF6_USART2        ((uint8_t)0x06)  /* USART2 Alternate Function mapping */
#define GPIO_AF6_USART3        ((uint8_t)0x06)  /* USART3 Alternate Function mapping */
#define GPIO_AF6_USART6        ((uint8_t)0x06)  /* USART6 Alternate Function mapping */

/**
  * @brief   AF 7 selection
  */
#define GPIO_AF7_FDCAN1        ((uint8_t)0x07)  /* FDCAN1 Alternate Function mapping  */
#define GPIO_AF7_FDCAN2        ((uint8_t)0x07)  /* FDCAN2 Alternate Function mapping  */
#define GPIO_AF7_FDCAN3        ((uint8_t)0x07)  /* FDCAN3 Alternate Function mapping  */
#define GPIO_AF7_LPTIM4        ((uint8_t)0x07)  /* LPTIM4 Alternate Function mapping  */
#define GPIO_AF7_LPTIM5        ((uint8_t)0x07)  /* LPTIM5 Alternate Function mapping  */
#define GPIO_AF7_TIM2          ((uint8_t)0x07)  /* TIM2 Alternate Function mapping  */
#define GPIO_AF7_TIM3          ((uint8_t)0x07)  /* TIM3 Alternate Function mapping  */
#define GPIO_AF7_TIM4          ((uint8_t)0x07)  /* TIM4 Alternate Function mapping  */
#define GPIO_AF7_TIM12         ((uint8_t)0x07)  /* TIM12 Alternate Function mapping  */
#define GPIO_AF7_TIM13         ((uint8_t)0x07)  /* TIM13 Alternate Function mapping  */
#define GPIO_AF7_TIM15         ((uint8_t)0x07)  /* TIM15 Alternate Function mapping  */
#define GPIO_AF7_TIM16         ((uint8_t)0x07)  /* TIM16 Alternate Function mapping  */
#define GPIO_AF7_TIM17         ((uint8_t)0x07)  /* TIM17 Alternate Function mapping  */
#define GPIO_AF7_TIM20         ((uint8_t)0x07)  /* TIM20 Alternate Function mapping  */

/**
  * @brief   AF 8 selection
  */
#define GPIO_AF8_ETH1          ((uint8_t)0x08)  /* ETH1 Alternate Function mapping  */
#define GPIO_AF8_I2C2          ((uint8_t)0x08)  /* I2C2 Alternate Function mapping  */
#define GPIO_AF8_I2C4          ((uint8_t)0x08)  /* I2C4 Alternate Function mapping  */
#define GPIO_AF8_I2C5          ((uint8_t)0x08)  /* I2C5 Alternate Function mapping  */
#define GPIO_AF8_I2C8          ((uint8_t)0x08)  /* I2C8 Alternate Function mapping  */
#define GPIO_AF8_I3C1          ((uint8_t)0x08)  /* I3C1 Alternate Function mapping  */
#define GPIO_AF8_TIM1          ((uint8_t)0x08)  /* TIM1 Alternate Function mapping  */
#define GPIO_AF8_TIM2          ((uint8_t)0x08)  /* TIM2 Alternate Function mapping  */
#define GPIO_AF8_TIM3          ((uint8_t)0x08)  /* TIM3 Alternate Function mapping  */
#define GPIO_AF8_TIM4          ((uint8_t)0x08)  /* TIM4 Alternate Function mapping  */
#define GPIO_AF8_TIM5          ((uint8_t)0x08)  /* TIM5 Alternate Function mapping  */
#define GPIO_AF8_TIM8          ((uint8_t)0x08)  /* TIM8 Alternate Function mapping  */
#define GPIO_AF8_TIM10         ((uint8_t)0x08)  /* TIM10 Alternate Function mapping */
#define GPIO_AF8_TIM11         ((uint8_t)0x08)  /* TIM11 Alternate Function mapping */
#define GPIO_AF8_TIM12         ((uint8_t)0x08)  /* TIM12 Alternate Function mapping  */
#define GPIO_AF8_TIM16         ((uint8_t)0x08)  /* TIM16 Alternate Function mapping  */
#define GPIO_AF8_TIM20         ((uint8_t)0x08)  /* TIM20 Alternate Function mapping  */
#define GPIO_AF8_UART7         ((uint8_t)0x08)  /* UART7 Alternate Function mapping  */
#define GPIO_AF8_USART2        ((uint8_t)0x08)  /* USART2 Alternate Function mapping  */

/**
  * @brief   AF 9 selection
  */
#define GPIO_AF9_FDCAN3        ((uint8_t)0x09)  /* FDCAN3 Alternate Function mapping   */
#define GPIO_AF9_ETH1          ((uint8_t)0x09)  /* ETH1 Alternate Function mapping   */
#define GPIO_AF9_ETH2          ((uint8_t)0x09)  /* ETH2 Alternate Function mapping   */
#define GPIO_AF9_DCMI          ((uint8_t)0x09)  /* DCMI Alternate Function mapping  */
#define GPIO_AF9_DCMIPP        ((uint8_t)0x09)  /* DCMIPP Alternate Function mapping  */
#define GPIO_AF9_PSSI          ((uint8_t)0x09)  /* PSSI Alternate Function mapping  */
#define GPIO_AF9_I2C1          ((uint8_t)0x09)  /* I2C1 Alternate Function mapping  */
#define GPIO_AF9_I2C2          ((uint8_t)0x09)  /* I2C2 Alternate Function mapping  */
#define GPIO_AF9_I2C3          ((uint8_t)0x09)  /* I2C3 Alternate Function mapping  */
#define GPIO_AF9_I2C4          ((uint8_t)0x09)  /* I2C4 Alternate Function mapping  */
#define GPIO_AF9_I2C5          ((uint8_t)0x09)  /* I2C5 Alternate Function mapping  */
#define GPIO_AF9_I2C6          ((uint8_t)0x09)  /* I2C6 Alternate Function mapping  */
#define GPIO_AF9_I2C7          ((uint8_t)0x09)  /* I2C7 Alternate Function mapping  */
#define GPIO_AF9_I2C8          ((uint8_t)0x09)  /* I2C8 Alternate Function mapping  */
#define GPIO_AF9_LPTIM5        ((uint8_t)0x09)  /* LPTIM5 Alternate Function mapping  */
#define GPIO_AF9_SDMMC1        ((uint8_t)0x09)  /* SDMMC1 Alternate Function mapping  */
#define GPIO_AF9_SDMMC2        ((uint8_t)0x09)  /* SDMMC2 Alternate Function mapping  */
#define GPIO_AF9_TIM4          ((uint8_t)0x09)  /* TIM4 Alternate Function mapping   */
#define GPIO_AF9_TIM5          ((uint8_t)0x09)  /* TIM5 Alternate Function mapping   */
#define GPIO_AF9_TIM10         ((uint8_t)0x09)  /* TIM10 Alternate Function mapping   */
#define GPIO_AF9_TIM12         ((uint8_t)0x09)  /* TIM12 Alternate Function mapping   */
#define GPIO_AF9_TIM14         ((uint8_t)0x09)  /* TIM14 Alternate Function mapping   */
#define GPIO_AF9_DSI           ((uint8_t)0x09)  /* DSI Alternate Function mapping   */
#define GPIO_AF9_USBH          ((uint8_t)0x09)  /* USBH Alternate Function mapping   */


/**
  * @brief   AF 10 selection
  */
#define GPIO_AF10_ETH1         ((uint8_t)0x0A)  /* ETH1 Alternate Function mapping */
#define GPIO_AF10_ETH2         ((uint8_t)0x0A)  /* ETH2 Alternate Function mapping */
#define GPIO_AF10_FMC          ((uint8_t)0x0A)  /* FMC Alternate Function mapping */
#define GPIO_AF10_I2C1         ((uint8_t)0x0A)  /* I2C1 Alternate Function mapping */
#define GPIO_AF10_I2C3         ((uint8_t)0x0A)  /* I2C3 Alternate Function mapping */
#define GPIO_AF10_I2C5         ((uint8_t)0x0A)  /* I2C5 Alternate Function mapping */
#define GPIO_AF10_I2C7         ((uint8_t)0x0A)  /* I2C7 Alternate Function mapping */
#define GPIO_AF10_I3C1         ((uint8_t)0x0A)  /* I3C1 Alternate Function mapping */
#define GPIO_AF10_I3C2         ((uint8_t)0x0A)  /* I3C2 Alternate Function mapping */
#define GPIO_AF10_OCTOSPIM_P1  ((uint8_t)0x0A)  /* OCTOSPIM_P1 Alternate Function mapping */
#define GPIO_AF10_OCTOSPIM_P2  ((uint8_t)0x0A)  /* OCTOSPIM_P2 Alternate Function mapping */
#define GPIO_AF10_SDMMC1       ((uint8_t)0x0A)  /* SDMMC1 Alternate Function mapping */
#define GPIO_AF10_SDMMC3       ((uint8_t)0x0A)  /* SDMMC3 Alternate Function mapping */
#define GPIO_AF10_TIM14        ((uint8_t)0x0A)  /* TIM14 Alternate Function mapping */
#define GPIO_AF10_LPTIM3       ((uint8_t)0x0A)  /* LPTIM3 Alternate Function mapping */
#define GPIO_AF10_LPTIM4       ((uint8_t)0x0A)  /* LPTIM4 Alternate Function mapping */
#define GPIO_AF10_LCD          ((uint8_t)0x0A)  /* LCD Alternate Function mapping    */


/**
  * @brief   AF 11 selection
  */
#define GPIO_AF11_ETH1         ((uint8_t)0x0B)  /* ETH1 Alternate Function mapping */
#define GPIO_AF11_ETH2         ((uint8_t)0x0B)  /* ETH2 Alternate Function mapping */
#define GPIO_AF11_FMC          ((uint8_t)0x0B)  /* FMC Alternate Function mapping */
#define GPIO_AF11_I2C3         ((uint8_t)0x0B)  /* I2C3 Alternate Function mapping */
#define GPIO_AF11_I2C5         ((uint8_t)0x0B)  /* I2C5 Alternate Function mapping */
#define GPIO_AF11_I3C4         ((uint8_t)0x0B)  /* I3C4 Alternate Function mapping */
#define GPIO_AF11_OCTOSPIM_P1  ((uint8_t)0x0B)  /* OCTOSPIM_P1 Alternate Function mapping */
#define GPIO_AF11_OCTOSPIM_P2  ((uint8_t)0x0B)  /* OCTOSPIM_P2 Alternate Function mapping */
#define GPIO_AF11_SDMMC1       ((uint8_t)0x0B)  /* SDMMC1 Alternate Function mapping */
#define GPIO_AF11_LCD          ((uint8_t)0x0B)  /* LCD Alternate Function mapping */
#define GPIO_AF11_USB3DR       ((uint8_t)0x0B)  /* USB3DR Alternate Function mapping */

/**
  * @brief   AF 12 selection
  */
#define GPIO_AF12_ETH1         ((uint8_t)0x0C)  /* ETH1 Alternate Function mapping */
#define GPIO_AF12_ETH2         ((uint8_t)0x0C)  /* ETH2 Alternate Function mapping */
#define GPIO_AF12_FMC          ((uint8_t)0x0C)  /* FMC Alternate Function mapping */
#define GPIO_AF12_I2C4         ((uint8_t)0x0C)  /* I2C4 Alternate Function mapping */
#define GPIO_AF12_OCTOSPIM_P2  ((uint8_t)0x0C)  /* OCTOSPIM_P2 Alternate Function mapping */
#define GPIO_AF12_SDMMC1       ((uint8_t)0x0C)  /* SDMMC1 Alternate Function mapping */
#define GPIO_AF12_SDMMC2       ((uint8_t)0x0C)  /* SDMMC2 Alternate Function mapping */
#define GPIO_AF12_SDMMC3       ((uint8_t)0x0C)  /* SDMMC3 Alternate Function mapping */
#define GPIO_AF12_LCD          ((uint8_t)0x0C)  /* LCD Alternate Function mapping */
#define GPIO_AF12_USBH         ((uint8_t)0x0C)  /* USBH Alternate Function mapping */
#define GPIO_AF12_DSI          ((uint8_t)0x0C)  /* DSI Alternate Function mapping */


/**
  * @brief   AF 13 selection
  */
#define GPIO_AF13_DCMI         ((uint8_t)0x0D)   /* DCMI Alternate Function mapping */
#define GPIO_AF13_DCMIPP       ((uint8_t)0x0D)   /* DCMIPP Alternate Function mapping */
#define GPIO_AF13_PSSI         ((uint8_t)0x0D)   /* PSSI Alternate Function mapping */
#define GPIO_AF13_DSI          ((uint8_t)0x0D)   /* DSI Alternate Function mapping */
#define GPIO_AF13_ETH1         ((uint8_t)0x0D)   /* ETH1 Alternate Function mapping */
#define GPIO_AF13_ETH2         ((uint8_t)0x0D)   /* ETH2 Alternate Function mapping */
#define GPIO_AF13_ETH3         ((uint8_t)0x0D)   /* ETH3 Alternate Function mapping */
#define GPIO_AF13_I3C2         ((uint8_t)0x0D)   /* I3C2 Alternate Function mapping */
#define GPIO_AF13_LCD          ((uint8_t)0x0D)   /* LCD Alternate Function mapping */
#define GPIO_AF13_OCTOSPIM_P1  ((uint8_t)0x0D)   /* OCTOSPIM_P1 Alternate Function mapping */
#define GPIO_AF13_SDMMC2       ((uint8_t)0x0D)   /* SDMMC2 Alternate Function mapping */

/**
  * @brief   AF 14 selection
  */
#define GPIO_AF14_DCMI         ((uint8_t)0x0E)   /* DCMI Alternate Function mapping */
#define GPIO_AF14_DCMIPP       ((uint8_t)0x0E)   /* DCMIPP Alternate Function mapping */
#define GPIO_AF14_PSSI         ((uint8_t)0x0E)   /* PSSI Alternate Function mapping */
#define GPIO_AF14_FMC          ((uint8_t)0x0E)   /* FMC Alternate Function mapping */
#define GPIO_AF14_SDMMC3       ((uint8_t)0x0E)   /* SDMMC3 Alternate Function mapping */
#define GPIO_AF14_ETH3         ((uint8_t)0x0E)   /* ETH3 Alternate Function mapping */
#define GPIO_AF14_LCD          ((uint8_t)0x0E)   /* LCD Alternate Function mapping */

#endif

/**
  * @brief   AF 15 selection
  */
#define GPIO_AF15_EVENTOUT     ((uint8_t)0x0F)  /* EVENTOUT Alternate Function mapping */

/**
   * @brief   check if AF is valid
   */
#define IS_GPIO_AF(AF)   ((AF) <= (uint8_t)0x0F)


/**
  * @}
  */

/**
  * @}
  */

/* Exported macro ------------------------------------------------------------*/
/* Exported functions --------------------------------------------------------*/
/* Private types -------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/
/* Private constants ---------------------------------------------------------*/
/* Private macros ------------------------------------------------------------*/
/** @defgroup GPIOEx_Private_Macros GPIO Private Macros
  * @{
  */
/** @defgroup GPIOEx_Get_Port_Index GPIO Get Port Index
  * @{
  */
#if defined(CORE_CM0PLUS)
#define GPIO_GET_INDEX(__GPIOx__)   (uint8_t)(((__GPIOx__) == (GPIOZ))? 11U :25U)
#else /* CORE_CM0PLUS */
#if defined(GPIOJ) && defined(GPIOK)
#define GPIO_GET_INDEX(__GPIOx__)   (uint8_t)(((__GPIOx__) == (GPIOA))? 0U :\
                                              ((__GPIOx__) == (GPIOB))? 1U :\
                                              ((__GPIOx__) == (GPIOC))? 2U :\
                                              ((__GPIOx__) == (GPIOD))? 3U :\
                                              ((__GPIOx__) == (GPIOE))? 4U :\
                                              ((__GPIOx__) == (GPIOF))? 5U :\
                                              ((__GPIOx__) == (GPIOG))? 6U :\
                                              ((__GPIOx__) == (GPIOH))? 7U :\
                                              ((__GPIOx__) == (GPIOI))? 8U :\
                                              ((__GPIOx__) == (GPIOJ))? 9U :\
                                              ((__GPIOx__) == (GPIOK))? 10U :\
                                              ((__GPIOx__) == (GPIOZ))? 11U : 25U)
#else /* GPIOJ && GPIOK */
#define GPIO_GET_INDEX(__GPIOx__)   (uint8_t)(((__GPIOx__) == (GPIOA))? 0U :\
                                              ((__GPIOx__) == (GPIOB))? 1U :\
                                              ((__GPIOx__) == (GPIOC))? 2U :\
                                              ((__GPIOx__) == (GPIOD))? 3U :\
                                              ((__GPIOx__) == (GPIOE))? 4U :\
                                              ((__GPIOx__) == (GPIOF))? 5U :\
                                              ((__GPIOx__) == (GPIOG))? 6U :\
                                              ((__GPIOx__) == (GPIOH))? 7U :\
                                              ((__GPIOx__) == (GPIOI))? 8U :\
                                              ((__GPIOx__) == (GPIOZ))? 9U : 25U)
#endif /* GPIOJ && GPIOK */
#endif  /* CORE_CM0PLUS */
/**
  * @}
  */

/**
  * @}
  */

/* Exported macro ------------------------------------------------------------*/
/** @defgroup GPIOEx_Exported_Macros GPIOEx Exported Macros
  * @{
  */

/** @addtogroup GPIOEx_Exported_Functions_Group1 Extended Peripheral Control functions
  * @{
  */


/**
  * @}
 */

/**
  * @}
  */

/* Exported functions --------------------------------------------------------*/
/**
  * @}
  */

/**
  * @}
  */

#ifdef __cplusplus
}
#endif

#endif /* __STM32MP2xx_HAL_GPIO_EX_H */
